In [18]:
import pandas as pd
import numpy as np

In [20]:
pd=pd.Series([1,0,2,np.NaN,2,3],
             index=['white','white','blue','green','green','yellow'])
pd

white     1.0
white     0.0
blue      2.0
green     NaN
green     2.0
yellow    3.0
dtype: float64

In [22]:
pd.unique()

array([ 1.,  0.,  2., nan,  3.])

In [26]:
s=pd.value_counts()
s

2.0    2
1.0    1
0.0    1
3.0    1
Name: count, dtype: int64

In [28]:
pd.isnull()

white     False
white     False
blue      False
green      True
green     False
yellow    False
dtype: bool

In [30]:
pd.notnull()

white      True
white      True
blue       True
green     False
green      True
yellow     True
dtype: bool

In [36]:
r=pd[1:4]
r

white    0.0
blue     2.0
green    NaN
dtype: float64

In [42]:
pd[4]

C:\Users\Sudhanva M L\AppData\Local\Temp\ipykernel_15764\793780174.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  pd[4]

2.0

In [44]:
type(pd)

pandas.core.series.Series

In [199]:
import pandas as pd
data= {'color' : ['blue','green','yellow','red','white'],
'object' : ['ball','pen','pencil','paper','mug'],
'price' : [1.2,1.0,0.6,0.9,1.7]}
fr=pd.DataFrame(data)
fr

    color  object  price
0    blue    ball    1.2
1   green     pen    1.0
2  yellow  pencil    0.6
3     red   paper    0.9
4   white     mug    1.7

In [52]:
type(fr)

pandas.core.frame.DataFrame

In [56]:
fr2=pd.DataFrame(data,columns=['object','price'])
fr2

   object  price
0    ball    1.2
1     pen    1.0
2  pencil    0.6
3   paper    0.9
4     mug    1.7

In [58]:
fr2=pd.DataFrame(data, index=['one','two','three','four','five'])
fr2

        color  object  price
one      blue    ball    1.2
two     green     pen    1.0
three  yellow  pencil    0.6
four      red   paper    0.9
five    white     mug    1.7

In [60]:
fr.columns

Index(['color', 'object', 'price'], dtype='object')

In [62]:
fr.index

RangeIndex(start=0, stop=5, step=1)

In [64]:
fr2.values

array([['blue', 'ball', 1.2],
       ['green', 'pen', 1.0],
       ['yellow', 'pencil', 0.6],
       ['red', 'paper', 0.9],
       ['white', 'mug', 1.7]], dtype=object)

In [66]:
fr.axes

[RangeIndex(start=0, stop=5, step=1),
 Index(['color', 'object', 'price'], dtype='object')]

In [68]:
fr.shape

(5, 3)

In [201]:
import pandas as pd
import numpy as np
data= pd.DataFrame(np.arange(16).reshape((4,4)),
                   index=['red','blue','yellow','white'],
                   columns=['ball','pen','pencil','paper'])
fr=pd.DataFrame(data)
fr

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [96]:
fr.index.name='id'
fr.columns.name='item'
fr

item    ball  pen  pencil  paper
id
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [203]:
fr['rubber']=12,13,14,15
fr

        ball  pen  pencil  paper  rubber
red        0    1       2      3      12
blue       4    5       6      7      13
yellow     8    9      10     11      14
white     12   13      14     15      15

In [205]:
fr.isin([1,'pen'])

         ball    pen  pencil  paper  rubber
red     False   True   False  False   False
blue    False  False   False  False   False
yellow  False  False   False  False   False
white   False  False   False  False   False

In [207]:
del fr['rubber']
fr

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [128]:
fr.T

id      red  blue  yellow  white
item
ball      0     4       8     12
pen       1     5       9     13
pencil    2     6      10     14
paper     3     7      11     15

In [130]:
import pandas as pd
import numpy as np

s=pd.Series([2,5,7,3],index=['one','two','three','four'])
s

one      2
two      5
three    7
four     3
dtype: int64

In [134]:
s=s.reindex(['three','four','five','one'])
s

three    7.0
four     3.0
five     NaN
one      2.0
dtype: float64

In [138]:
s2=pd.Series([1,5,6,3],index=[0,3,5,6])
s2

0    1
3    5
5    6
6    3
dtype: int64

In [140]:
s2.reindex(np.arange(6),method='bfill')

0    1
1    5
2    5
3    5
4    6
5    6
dtype: int64

In [142]:
s2.reindex(np.arange(6),method='ffill')

0    1
1    1
2    1
3    5
4    5
5    6
dtype: int64

In [146]:
import numpy as np
import pandas as pd
s=pd.Series(np.arange(4),index=['red','blue','yellow','white'])
s

red       0
blue      1
yellow    2
white     3
dtype: int32

In [150]:
s.idxmax()

'white'

In [152]:
s.idxmin()

'red'

In [154]:
s.drop(['yellow','white'])

red     0
blue    1
dtype: int32

In [160]:
s.sort_index(ascending=True)

blue      1
red       0
white     3
yellow    2
dtype: int32

In [162]:
import pandas as pd

data=({'Brand': ['Maruti', 'Hyundai', 'Tata','Mahindra', 'Maruti',
                 'Hyundai','Renault', 'Tata', 'Maruti'],
       'Year': [2012, 2014, 2011, 2015,2012,2016, 2014, 2018, 2019],
       'Kms Driven': [50000, 30000, 60000,
                      25000, 10000, 46000,1000, 15000, 12000],
       'City': ['Gurgaon', 'Delhi', 'Mumbai','Delhi',
                'Mumbai', 'Delhi','Mumbai', 'Chennai','Ghaziabad'],
       'Mileage': [28, 27, 25, 26, 28,29, 24, 21, 24]})
df=pd.DataFrame(data)
df

      Brand  Year  Kms Driven       City  Mileage
0    Maruti  2012       50000    Gurgaon       28
1   Hyundai  2014       30000      Delhi       27
2      Tata  2011       60000     Mumbai       25
3  Mahindra  2015       25000      Delhi       26
4    Maruti  2012       10000     Mumbai       28
5   Hyundai  2016       46000      Delhi       29
6   Renault  2014        1000     Mumbai       24
7      Tata  2018       15000    Chennai       21
8    Maruti  2019       12000  Ghaziabad       24

In [166]:
df.loc[0:4,('Year','City')]

   Year     City
0  2012  Gurgaon
1  2014    Delhi
2  2011   Mumbai
3  2015    Delhi
4  2012   Mumbai

In [168]:
df.iloc[0:4]

      Brand  Year  Kms Driven     City  Mileage
0    Maruti  2012       50000  Gurgaon       28
1   Hyundai  2014       30000    Delhi       27
2      Tata  2011       60000   Mumbai       25
3  Mahindra  2015       25000    Delhi       26

In [170]:
df.loc[0:4]

      Brand  Year  Kms Driven     City  Mileage
0    Maruti  2012       50000  Gurgaon       28
1   Hyundai  2014       30000    Delhi       27
2      Tata  2011       60000   Mumbai       25
3  Mahindra  2015       25000    Delhi       26
4    Maruti  2012       10000   Mumbai       28

In [172]:
df.iloc[::4]

    Brand  Year  Kms Driven       City  Mileage
0  Maruti  2012       50000    Gurgaon       28
4  Maruti  2012       10000     Mumbai       28
8  Maruti  2019       12000  Ghaziabad       24

In [174]:
df.iloc[0:4,1:4]

   Year  Kms Driven     City
0  2012       50000  Gurgaon
1  2014       30000    Delhi
2  2011       60000   Mumbai
3  2015       25000    Delhi

In [176]:
df.loc[df['Kms Driven']<12000]

     Brand  Year  Kms Driven    City  Mileage
4   Maruti  2012       10000  Mumbai       28
6  Renault  2014        1000  Mumbai       24

In [178]:
df.loc[3,'City']

'Delhi'

In [184]:
df.loc[(df['Year']<2014) & (df['Mileage']<29)]

    Brand  Year  Kms Driven     City  Mileage
0  Maruti  2012       50000  Gurgaon       28
2    Tata  2011       60000   Mumbai       25
4  Maruti  2012       10000   Mumbai       28

In [186]:
df.loc[df['Brand'].str.contains("M")]

      Brand  Year  Kms Driven       City  Mileage
0    Maruti  2012       50000    Gurgaon       28
3  Mahindra  2015       25000      Delhi       26
4    Maruti  2012       10000     Mumbai       28
8    Maruti  2019       12000  Ghaziabad       24

In [192]:
df.loc[df['Brand'].str.startswith("T")]

  Brand  Year  Kms Driven     City  Mileage
2  Tata  2011       60000   Mumbai       25
7  Tata  2018       15000  Chennai       21

In [194]:
df.loc[df['Brand'].str.endswith("i")]

     Brand  Year  Kms Driven       City  Mileage
0   Maruti  2012       50000    Gurgaon       28
1  Hyundai  2014       30000      Delhi       27
4   Maruti  2012       10000     Mumbai       28
5  Hyundai  2016       46000      Delhi       29
8   Maruti  2019       12000  Ghaziabad       24

In [196]:
df.loc[~df['Brand'].str.startswith("T")]

      Brand  Year  Kms Driven       City  Mileage
0    Maruti  2012       50000    Gurgaon       28
1   Hyundai  2014       30000      Delhi       27
3  Mahindra  2015       25000      Delhi       26
4    Maruti  2012       10000     Mumbai       28
5   Hyundai  2016       46000      Delhi       29
6   Renault  2014        1000     Mumbai       24
8    Maruti  2019       12000  Ghaziabad       24